/**
 * Нейрон — это вычислительная единица, которая получает информацию, производит над ней простые вычисления и передает ее дальше.
 *
 * Они делятся на три основных типа:
 * 		входной
 * 		скрытый и
 * 		выходной
 * 		нейрон смещения
 * 		контекстный нейрон
 *
 * 	Ошибка — это процентная величина, отражающая расхождение между ожидаемым и полученным ответами
 * 		Mean Squared Error (далее MSE),
 * 		Root MSE
 * 		Arctan
 *
 * 	Существует несколько методов обучения
 * 		Метод обратного распространения (Backpropagation)
 * 		Метод упругого распространения (Resilient propagation или Rprop)
 * 		Генетический Алгоритм (Genetic Algorithm)
 *
 * 	URLs Прочитанные:
 * 		https://habr.com/ru/post/312450/
 *
 * 	URLs новые:
 * 		https://habr.com/ru/post/313216/
 * 	http://synset.com/ai/ru/nn/NeuralNet_01_Intro.html
 *
 */
package ua.in.sz.neuralnetworks;